In [66]:
#pip install psycopg

In [69]:
import sqlite3
import numpy as np
import pandas as pd
import psycopg2

In [70]:
conn = sqlite3.connect('PRA1.db')

In [71]:
cursor = conn.cursor()

In [72]:
with open('BBDD_ERP_data.sql', 'r') as s:
    script = s.read()
    cursor.executescript(script)

IntegrityError: UNIQUE constraint failed: tb_company.co_code

In [41]:
conn.commit()

In [73]:
#VER TABLAS DE LA BD

q=""" 
 SELECT * FROM sqlite_master WHERE type = "table";
 """
df = pd.read_sql(q, conn)
df

,type,name,tbl_name,rootpage,sql
0,table,tb_company,tb_company,2,CREATE TABLE tb_company\n (\n ...
1,table,tb_customer,tb_customer,4,CREATE TABLE tb_customer\n (\n ...
2,table,tb_site,tb_site,6,CREATE TABLE tb_site\n (\n c...
3,table,tb_iva,tb_iva,12,CREATE TABLE tb_iva\n (\n co...
4,table,tb_invoice,tb_invoice,8,CREATE TABLE tb_invoice\n (\n ...
5,table,tb_lines,tb_lines,10,CREATE TABLE tb_lines\n (\n ...

* a) Proporcionar los nombres de los clientes que empiezan por AGR.  
    Queremos obtener el número de cliente, nombre y NIF.  
    Los datos deben aparecer ordenados por número de cliente en orden descendiente.

In [40]:
q=""" 
SELECT cust_no, cust_name, cust_cif
FROM tb_customer
WHERE cust_name LIKE 'AGR%'
ORDER BY cust_no DESC
"""
df = pd.read_sql(q, conn)
df

  cust_no          cust_name   cust_cif
0   C0016     AGR SANT JOAN   B81232171
1   C0007         AGRIMARCOS  B98766562
2   C0006           AGR AGRI  B78788999
3   C0002  AGRICULTURA VIVES  A66666666

* b) Proporcionar las facturas de clientes con dirección en la ciudad de Granada.  
    Queremos obtener el número de cliente, nombre de cliente, dirección, ciudad y número de factura.  
    La consulta debe estar ordenada por número de cliente ascendientemente y número de factura descendentemente.

In [82]:
q=""" 
SELECT i.cust_no, c.cust_name, s.site_address, s.site_city, i.invoice_no
FROM tb_invoice as i
INNER JOIN tb_customer as c ON i.cust_no=c.cust_no
INNER JOIN tb_site as s ON c.cust_no=s.cust_no
WHERE s.site_city LIKE "GRANADA"
"""
df = pd.read_sql(q, conn)
df.pivot_table(index=['cust_no', 'cust_name','site_address', 'site_city', 'invoice_no'])

Empty DataFrame
Columns: []
Index: [(C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000001), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000002), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000003), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000004), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000005), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000006), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000007), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000008), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000009), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000010), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000011), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000012), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000013), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000014), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000015), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000016), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000017), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000018), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000019), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000020), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000021), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000022), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000023), (C0010, VIAJES MUNDO, Av. Andalucia, 190, Granada, F0000C001000024)]

* c) Proporcionar la/s compañía/s con mayor número de facturas.  
    Queremos obtener el código de compañía, el nombre de la compañía y el número de facturas.  
    En caso de haber más de una compañía, los resultados deben aparecer ordenados por nombre de compañía.

In [92]:
q=""" 
SELECT c.co_code, c.co_name, invoice_no
FROM tb_company as c
INNER JOIN tb_invoice as i ON i.co_code=c.co_code

"""
df = pd.read_sql(q, conn)

df.groupby(["co_code","co_name"]).agg('size').sort_values(ascending=False)

co_code  co_name
AB1      PGD CENTRAL INC          109
BC4      PGD ESTE INC             108
AA2      PGD SUR INC              102
XX6      PGD INTERNACIONAL INC     64
BB5      PGD OESTE INC             48
AX3      PGD NORTE INC             32
dtype: int64

* d) Proporcionar la lista de facturas que contienen más de 18 líneas de factura.  
    Queremos ver el número de factura, el cliente, el nombre de la compañía y el número de líneas en total.     
    La información debe estar ordenada por número de líneas de forma descendente y compañía.

In [99]:

q=""" 
SELECT i.invoice_no, cu.cust_name, co.co_name, l.line_num
FROM tb_lines as l
INNER JOIN tb_invoice as i ON l.invoice_id=i.invoice_id
INNER JOIN tb_customer as cu ON cu.cust_no=i.cust_no
INNER JOIN tb_company as co ON i.co_code=co.co_code
WHERE line_num>18
ORDER BY l.line_num DESC, co.co_name
"""
df = pd.read_sql(q, conn)

df

          invoice_no           cust_name          co_name  line_num
0    F0000C000200157   AGRICULTURA VIVES  PGD CENTRAL INC        24
1    F0000C000200161   AGRICULTURA VIVES  PGD CENTRAL INC        24
2    F0000C000300187  CULTIVOS MARAVILLA  PGD CENTRAL INC        24
3    F0000C000200148   AGRICULTURA VIVES  PGD CENTRAL INC        24
4    F0000C000400203     ASOCIADOS PEREZ  PGD CENTRAL INC        24
..               ...                 ...              ...       ...
433  F0000C001200059       PIENSOS JAIME      PGD SUR INC        19
434  F0000C001200061       PIENSOS JAIME      PGD SUR INC        19
435  F0000C001200063       PIENSOS JAIME      PGD SUR INC        19
436  F0000C001300065       GESTORIA LUIS      PGD SUR INC        19
437  F0000C001300066       GESTORIA LUIS      PGD SUR INC        19

[438 rows x 4 columns]

* e) Proporcionar una lista con el importe de las facturas pendientes de cobrar,  
    es decir, aquellas que no hayan sido pagadas.       
    Queremos ver el código de compañía, nombre de la compañía, número de cliente, nombre de cliente, total IVA y total factura (tot_amount).        
    Los resultados deben aparecer ordenados por nombre de compañía ascendiente y código de cliente descendentemente

In [107]:
q=""" 
SELECT i.co_code, co.co_name, cu.cust_no, cu.cust_name, i.iva_amount, i.tot_amount
FROM tb_invoice as i
INNER JOIN tb_company as co ON i.co_code=co.co_code
INNER JOIN tb_customer as cu ON i.cust_no=cu.cust_no
WHERE payed="N"
ORDER BY co.co_name ASC, i.cust_no DESC
"""
df = pd.read_sql(q, conn)

df.pivot_table(index=['co_code', 'co_name','cust_no', 'cust_name'], aggfunc= 'sum')

                                                          iva_amount
co_code co_name               cust_no cust_name
AA2     PGD SUR INC           C0010   VIAJES MUNDO          43240.97  \
                              C0011   SEMILLAS MARIA        20000.25
                              C0012   PIENSOS JAIME         19589.73
                              C0013   GESTORIA LUIS         51416.31
                              C0014   CONSULTORES ORC       22373.75
AB1     PGD CENTRAL INC       C0001   PIENSOS MARTIN        27729.28
                              C0002   AGRICULTURA VIVES     44762.67
                              C0003   CULTIVOS MARAVILLA    12789.14
                              C0004   ASOCIADOS PEREZ        9263.33
AX3     PGD NORTE INC         C0005   TECNICOS AVA          42595.05
BB5     PGD OESTE INC         C0005   TECNICOS AVA          23215.68
                              C0006   AGR AGRI              62760.73
BC4     PGD ESTE INC          C0007   AGRIMARCOS            33545.73
                              C0008   CULTIVANDO ALEGRIA    76471.36
                              C0009   MARCOS LIMPIEZA       11199.55
XX6     PGD INTERNACIONAL INC C0015   APR T                 78873.81

                                                          tot_amount
co_code co_name               cust_no cust_name
AA2     PGD SUR INC           C0010   VIAJES MUNDO         249150.49
                              C0011   SEMILLAS MARIA       115239.55
                              C0012   PIENSOS JAIME        112873.94
                              C0013   GESTORIA LUIS        296255.66
                              C0014   CONSULTORES ORC      128915.43
AB1     PGD CENTRAL INC       C0001   PIENSOS MARTIN       254510.80
                              C0002   AGRICULTURA VIVES    403042.85
                              C0003   CULTIVOS MARAVILLA   117387.48
                              C0004   ASOCIADOS PEREZ       81601.96
AX3     PGD NORTE INC         C0005   TECNICOS AVA         245428.49
BB5     PGD OESTE INC         C0005   TECNICOS AVA         133766.59
                              C0006   AGR AGRI             361621.32
BC4     PGD ESTE INC          C0007   AGRIMARCOS           193287.21
                              C0008   CULTIVANDO ALEGRIA   440620.32
                              C0009   MARCOS LIMPIEZA       64530.69
XX6     PGD INTERNACIONAL INC C0015   APR T                614286.62